package com.overazumov.contacts

import kotlin.random.Random


data class Contact(
    val name: String,
    val surname: String,
    val phoneNumber: PhoneNumber,
    val id: Int = IdGenerator.generateNextId()
) {

    data class PhoneNumber(val number: String) {
        override fun toString(): String {
            number.apply {
                return "+7 (${substring(0, 3)}) ${substring(3, 6)}-${substring(6, 8)}-${substring(8)}"
            }
        }
    }

    private object IdGenerator {
        private var currentId = 0

        fun generateNextId() = currentId++
    }

    object Fabric {
        fun createContacts(fullNames: List<String>): List<Contact> {
            val result = mutableListOf<Contact>()
            for (fullName in fullNames) {
                val (name, surname) = fullName.split("\\s".toRegex())
                result.add(Contact(name, surname, PhoneNumber(generateNumber().toString())))
            }
            return result
        }

        private fun generateNumber() = Random.nextLong(1000000000, 9999999999)
    }
}

val fullNames = listOf(
    "Сагиндык Магузумов",
    "Артур Севастьян",
    "Елдос Жыклымбаев",
    "Нурлан Ахметов",
    "Айгерим Садыкова",
    "Амир Хусаинов",
    "Гульназ Искакова",
    "Аскар Баймухаметов",
    "Гульмира Жумадилова",
    "Фарид Зарипов",
    "Ануш Абрамян",
    "Жансая Касенова",
    "Данияр Нурмагамбетов",
    "Салтанат Абишева",
    "Элман Ибраев",
    "Айша Токбергенова",
    "Нурсултан Жумагулов",
    "Мадина Жанибекова",
    "Бакыт Жакупов",
    "Карлыгаш Абдрахманова",
    "Талгат Рыскулов",
    "Жанна Кудырбаева",
    "Даулет Сулейменов",
    "Асель Токтарова",
    "Марат Тажибаев",
    "Армен Арутян",
    "Динара Куанышева",
    "Алмас Тулегенов",
    "Сауле Асильбекова",
    "Серик Кайратов",
    "Жулдыз Батырбекова",
    "Арман Тасмагамбетов",
    "Дана Сагынтаева",
    "Нурлан Алдабергенов",
    "Гульшат Жоламанова",
    "Айдар Базарбаев",
    "Салтанат Калиева",
    "Эркин Мухаметов",
    "Жанна Турискбекова",
    "Дамир Хамзаев",
    "Сона Саоргосян",
    "Сауле Батырханова",
    "Нурбол Болатов",
    "Амина Темиргалиева",
    "Бейбит Жарылкасымов",
    "Гульнара Тажибаева",
    "Алибек Сарсенов",
    "Жансулу Жанабекова",
    "Нуржан Казыбеков",
    "Гаян Мелконян",
    "Аяулым Курманбекова",
    "Марат Тулеубаев",
    "Гульим Мухаметкаримова",
    "Данияр Сейтжанов",
    "Айжан Байгазина",
    "Нурлан Амангельдинов",
    "Жанара Касымова",
    "Бауржан Бекмурзаев",
    "Динара Жумабекова",
    "Арман Жарасов",
    "Анита Авгаян",
    "Гульнара Мамбетова",
    "Айдана Жолдасова",
    "Бакытжан Муратов",
    "Мадина Ахметова",
    "Алмас Куандыков",
    "Жулдыз Абдрахманова",
    "Нурсултан Мухамедов",
    "Салтанат Жумабаева",
    "Аслан Байбеков",
    "Гульмира Бисенова",
    "Даурен Жарасов",
    "Айжан Жумагулова",
    "Талгат Оспанов",
    "Рафаэль Аракелян",
    "Жанна Амирханова",
    "Нурлыбек Куандыков",
    "Айжан Толеубаева",
    "Асхат Жетписов",
    "Гульназ Хамитова",
    "Эрлан Ибраев",
    "Жанар Баймухаметова",
    "Даулет Тажибаев",
    "Гульжан Жапарова",
    "Лусине Геворкян",
    "Нурлан Амиркулов",
    "Гулим Ахметова",
    "Бахтияр Ергешов",
    "Динара Сарсенова",
    "Нуржан Байкенов",
    "Карлыгаш Рыскулова",
    "Айсулу Токбергенова",
    "Нуржан Тулегенов",
    "Гарик Апраксин",
    "Гульнур Асильбекова",
    "Абзал Мухамедов",
    "Айжан Амангельдинова",
    "Нурлан Мухаметов",
    "Айжан Турискбекова",
    "Арман Жумабек",
    "Светлан Минасян"
)
